УТ.КонтурЗакупки/src/Enums/КонтурЗакупки_СтатусыОбработкиЗакупки/КонтурЗакупки_СтатусыОбработкиЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЗакупки_СтатусыОбработкиЗакупки</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ПринятВРаботу</name>
  </enumValues>
  <enumValues>
    <name>НаСогласованииУЛогиста</name>
  </enumValues>
  <enumValues>
    <name>СогласованСЛогистом</name>
  </enumValues>
  <enumValues>
    <name>ПоданаЗаявкаНаУчастие</name>
  </enumValues>
  <enumValues>
    <name>Переторжка</name>
  </enumValues>
  <enumValues>
    <name>Выигран</name>
  </enumValues>
  <enumValues>
    <name>Проигран</name>
  </enumValues>
  <enumValues>
    <name>ЗаключениеДоговора</name>
  </enumValues>
</mdclass:Enum>

УТ.КонтурЗакупки/src/Enums/КонтурЗакупки_СтатусыОбработкиЗакупки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Получить массив статусов обработки по роли.
// 
// Параметры:
//  РольПользователя - ОбъектМетаданныхРоль - Роль пользователя
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.КонтурЗакупки_СтатусыОбработкиЗакупки - Получить массив статусов обработки по роли
Функция ПолучитьМассивСтатусовОбработкиПоРоли(РольПользователя) Экспорт
	МассивСтатусов = Новый Массив;// - ПеречислениеСсылка.КонтурЗакупки_СтатусыОбработкиЗакупки
	Если РольПользователя = Метаданные.Роли.КонтурЗакупки_ОтделЛогистики Тогда
		МассивСтатусов.Добавить(НаСогласованииУЛогиста);
	ИначеЕсли РольПользователя = Метаданные.Роли.КонтурЗакупки_ОтделПродаж Тогда
		МассивСтатусов.Добавить(ПустаяСсылка());
		МассивСтатусов.Добавить(Новая);
		МассивСтатусов.Добавить(СогласованСЛогистом);
		МассивСтатусов.Добавить(ПоданаЗаявкаНаУчастие);
		МассивСтатусов.Добавить(ЗаключениеДоговора);
	ИначеЕсли РольПользователя = Метаданные.Роли.КонтурЗакупки_ОтделСнабжения Тогда
		МассивСтатусов.Добавить(ПринятВРаботу);
		МассивСтатусов.Добавить(Переторжка);
	КонецЕсли;
	Возврат МассивСтатусов;
КонецФункции
#КонецОбласти
#КонецЕсли
